theis999/P6-code/sdkconfig.defaults
#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_PREFERRED=y
# default:
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# default:
CONFIG_SECURE_ROM_DL_MODE_ENABLED=y
# end of Security features

#
# Application manager
#
# default:
CONFIG_APP_COMPILE_TIME_DATE=y
# default:
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# default:
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# default:
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
# default:
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=9
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_HAS_MZ_CRC32=y
# default:
CONFIG_ESP_ROM_HAS_JPEG_DECODE=y
# default:
CONFIG_ESP_ROM_UART_CLK_IS_XTAL=y
# default:
CONFIG_ESP_ROM_HAS_RETARGETABLE_LOCKING=y
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=3
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=4
# default:
CONFIG_ESP_ROM_HAS_ERASE_0_REGION_BUG=y
# default:
CONFIG_ESP_ROM_HAS_ENCRYPTED_WRITES_USING_LEGACY_DRV=y
# default:
CONFIG_ESP_ROM_GET_CLK_FREQ=y
# default:
CONFIG_ESP_ROM_HAS_HAL_WDT=y
# default:
CONFIG_ESP_ROM_NEEDS_SWSETUP_WORKAROUND=y
# default:
CONFIG_ESP_ROM_HAS_LAYOUT_TABLE=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH_MMAP=y
# default:
CONFIG_ESP_ROM_HAS_ETS_PRINTF_BUG=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_FORMAT=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_32BIT_TIME=y
# default:
CONFIG_ESP_ROM_NEEDS_SET_CACHE_MMU_SIZE=y
# default:
CONFIG_ESP_ROM_RAM_APP_NEEDS_MMU_INIT=y
# default:
CONFIG_ESP_ROM_HAS_FLASH_COUNT_PAGES_BUG=y
# default:
CONFIG_ESP_ROM_HAS_CACHE_SUSPEND_WAITI_BUG=y
# default:
CONFIG_ESP_ROM_HAS_CACHE_WRITEBACK_BUG=y
# default:
CONFIG_ESP_ROM_HAS_SW_FLOAT=y
# default:
CONFIG_ESP_ROM_HAS_VERSION=y
# default:
CONFIG_ESP_ROM_SUPPORT_DEEP_SLEEP_WAKEUP_STUB=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y
# default:
CONFIG_ESP_ROM_CONSOLE_OUTPUT_SECONDARY=y

#
# Boot ROM Behavior
#
# default:
CONFIG_BOOT_ROM_LOG_ALWAYS_ON=y
# default:
# CONFIG_BOOT_ROM_LOG_ALWAYS_OFF is not set
# default:
# CONFIG_BOOT_ROM_LOG_ON_GPIO_HIGH is not set
# default:
# CONFIG_BOOT_ROM_LOG_ON_GPIO_LOW is not set
# end of Boot ROM Behavior

#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
# default:
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_120M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# default:
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Example Configuration
#
# default:
CONFIG_EXAMPLE_PROV_TRANSPORT_BLE=y
# default:
# CONFIG_EXAMPLE_PROV_TRANSPORT_SOFTAP is not set
# default:
# CONFIG_EXAMPLE_PROV_SECURITY_VERSION_1 is not set
# default:
CONFIG_EXAMPLE_PROV_SECURITY_VERSION_2=y
# default:
CONFIG_EXAMPLE_PROV_SEC2_DEV_MODE=y
# default:
# CONFIG_EXAMPLE_PROV_SEC2_PROD_MODE is not set
# default:
CONFIG_EXAMPLE_PROV_TRANSPORT=1
# default:
# CONFIG_EXAMPLE_PROV_ENABLE_APP_CALLBACK is not set
# CONFIG_EXAMPLE_RESET_PROVISIONED is not set
# default:
CONFIG_EXAMPLE_RESET_PROV_MGR_ON_FAILURE=y
# default:
CONFIG_EXAMPLE_PROV_MGR_CONNECTION_CNT=5
# default:
CONFIG_EXAMPLE_PROV_SHOW_QR=y
# default:
# CONFIG_EXAMPLE_REPROVISIONING is not set
# end of Example Configuration

#
# Compiler options
#
# default:
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
# default:
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# default:
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# default:
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# default:
CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR=y
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING is not set
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_CONTROLLER_ONLY is not set
# default:
CONFIG_BT_CONTROLLER_ENABLED=y
# default:
# CONFIG_BT_CONTROLLER_DISABLED is not set

#
# NimBLE Options
#

#
# General
#
# default:
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=y
# default:
# CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_DEFAULT is not set
# default:
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0
# default:
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y
# default:
# CONFIG_BT_NIMBLE_PINNED_TO_CORE_1 is not set
# default:
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
# default:
CONFIG_BT_NIMBLE_LEGACY_VHCI_ENABLE=y
# end of General

#
# Roles and Profiles
#
# default:
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
# default:
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
# default:
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# default:
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
# default:
CONFIG_BT_NIMBLE_GATT_CLIENT=y
# default:
CONFIG_BT_NIMBLE_GATT_SERVER=y
# end of Roles and Profiles

#
# Security (SMP)
#
# default:
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
# default:
CONFIG_BT_NIMBLE_SM_LEGACY=y
# default:
CONFIG_BT_NIMBLE_SM_SC=y
# default:
# CONFIG_BT_NIMBLE_SM_SC_DEBUG_KEYS is not set
# default:
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_ENCRYPTION=y
# default:
CONFIG_BT_NIMBLE_SM_LVL=0
# default:
CONFIG_BT_NIMBLE_SM_SC_ONLY=0
# default:
# CONFIG_BT_NIMBLE_SMP_ID_RESET is not set
# default:
# CONFIG_BT_NIMBLE_NVS_PERSIST is not set
# default:
CONFIG_BT_NIMBLE_MAX_BONDS=3
# default:
# CONFIG_BT_NIMBLE_HANDLE_REPEAT_PAIRING_DELETION is not set
# end of Security (SMP)

#
# GAP
#
# default:
CONFIG_BT_NIMBLE_RPA_TIMEOUT=900
# default:
CONFIG_BT_NIMBLE_WHITELIST_SIZE=12
# default:
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=y
# default:
CONFIG_BT_NIMBLE_MAX_CONN_REATTEMPT=3
# default:
CONFIG_BT_NIMBLE_HS_PVCY=y
# default:
# CONFIG_BT_NIMBLE_HOST_ALLOW_CONNECT_WITH_SCAN is not set
# default:
# CONFIG_BT_NIMBLE_HOST_QUEUE_CONG_CHECK is not set
# default:
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
# default:
CONFIG_BT_NIMBLE_MAX_CCCDS=8
# default:
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
# default:
CONFIG_BT_NIMBLE_HS_STOP_TIMEOUT_MS=2000
# default:
CONFIG_BT_NIMBLE_USE_ESP_TIMER=y
# default:
# CONFIG_BT_NIMBLE_HS_FLOW_CTRL is not set
# end of GAP

#
# GATT / ATT
#
# default:
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
# default:
CONFIG_BT_NIMBLE_ATT_MAX_PREP_ENTRIES=64
# default:
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4
# default:
# CONFIG_BT_NIMBLE_BLE_GATT_BLOB_TRANSFER is not set
# default:
# CONFIG_BT_NIMBLE_GATT_CACHING is not set
# default:
# CONFIG_BT_NIMBLE_INCL_SVC_DISCOVERY is not set
# end of GATT / ATT

#
# L2CAP
#
# default:
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=0
# end of L2CAP

#
# Memory Settings
#
# default:
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=12
# default:
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=256
# default:
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=24
# default:
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=320
# default:
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=24
# default:
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=255
# default:
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
# default:
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=30
# default:
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=8
# default:
CONFIG_BT_NIMBLE_L2CAP_COC_SDU_BUFF_COUNT=1
# default:
# CONFIG_BT_NIMBLE_MEMPOOL_RUNTIME_ALLOC is not set
# end of Memory Settings

#
# BLE 5.x Features
#
# default:
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=y
# default:
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_2M_PHY=y
# default:
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_CODED_PHY=y
# default:
# CONFIG_BT_NIMBLE_EXT_ADV is not set
# default:
# CONFIG_BT_NIMBLE_EXT_SCAN is not set
# default:
# CONFIG_BT_NIMBLE_ISO is not set
# end of BLE 5.x Features

#
# Services
#
# default:
CONFIG_BT_NIMBLE_PROX_SERVICE=y
# default:
CONFIG_BT_NIMBLE_ANS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_CTS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_HTP_SERVICE=y
# default:
CONFIG_BT_NIMBLE_IPSS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_TPS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_IAS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_LLS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_SPS_SERVICE=y
# default:
CONFIG_BT_NIMBLE_HR_SERVICE=y
# default:
# CONFIG_BT_NIMBLE_HID_SERVICE is not set
# default:
CONFIG_BT_NIMBLE_BAS_SERVICE=y
# default:
# CONFIG_BT_NIMBLE_SVC_BAS_BATTERY_LEVEL_NOTIFY is not set
# default:
CONFIG_BT_NIMBLE_DIS_SERVICE=y
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_MANUFACTURER_NAME is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_SERIAL_NUMBER is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_HARDWARE_REVISION is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_FIRMWARE_REVISION is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_SOFTWARE_REVISION is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_SYSTEM_ID is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_PNP_ID is not set
# default:
# CONFIG_BT_NIMBLE_SVC_DIS_INCLUDED is not set
# default:
CONFIG_BT_NIMBLE_GAP_SERVICE=y
# default:
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="nimble"
# default:
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31
# default:
CONFIG_BT_NIMBLE_SVC_GAP_APPEARANCE=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_ENC=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_AUTHEN=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE_PERM_AUTHOR=0
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_GATT_SECURITY_LEVEL is not set
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_RPA_ONLY is not set
# default:
CONFIG_BT_NIMBLE_SVC_GAP_CAR_CHAR_NOT_SUPP=y
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_CAR_NOT_SUPP is not set
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_CAR_SUPP is not set
# default:
CONFIG_BT_NIMBLE_SVC_GAP_CENT_ADDR_RESOLUTION=-1

#
# GAP Appearance write permissions
#
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE is not set
# default:
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ENC=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ATHN=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_APPEAR_WRITE_PERM_ATHR=0
# end of GAP Appearance write permissions

#
# GAP device name write permissions
#
# default:
# CONFIG_BT_NIMBLE_SVC_GAP_NAME_WRITE is not set
# end of GAP device name write permissions

#
# Peripheral Preferred Connection Parameters (PPCP) settings
#
# default:
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MAX_CONN_INTERVAL=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_MIN_CONN_INTERVAL=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SLAVE_LATENCY=0
# default:
CONFIG_BT_NIMBLE_SVC_GAP_PPCP_SUPERVISION_TMO=0
# end of Peripheral Preferred Connection Parameters (PPCP) settings
# end of Services

#
# Extra Features
#
# default:
# CONFIG_BT_NIMBLE_DYNAMIC_SERVICE is not set
# default:
# CONFIG_BT_NIMBLE_BLUFI_ENABLE is not set
# default:
# CONFIG_BT_NIMBLE_ENC_ADV_DATA is not set
# default:
# CONFIG_BT_NIMBLE_ADV_UUID_CONCAT is not set
# default:
# CONFIG_BT_NIMBLE_GATTC_PROC_PREEMPTION_PROTECT is not set
# default:
# CONFIG_BT_NIMBLE_GATTC_AUTO_PAIR is not set
# default:
CONFIG_BT_NIMBLE_EATT_CHAN_NUM=0
# default:
# CONFIG_BT_NIMBLE_SUBRATE is not set
# default:
# CONFIG_BT_NIMBLE_STATIC_PASSKEY is not set
# default:
CONFIG_BT_NIMBLE_DTM_MODE_TEST=y
# default:
CONFIG_BT_NIMBLE_MEM_OPTIMIZATION=y
# default:
CONFIG_BT_NIMBLE_STATIC_TO_DYNAMIC=y
# default:
CONFIG_BT_NIMBLE_SM_SIGN_CNT=y
# default:
CONFIG_BT_NIMBLE_CPFD_CAFD=y
# default:
CONFIG_BT_NIMBLE_RECONFIG_MTU=y
# default:
# CONFIG_BT_NIMBLE_LOW_SPEED_MODE is not set
# end of Extra Features

#
# NimBLE Mesh
#
# default:
# CONFIG_BT_NIMBLE_MESH is not set
# end of NimBLE Mesh

#
# Host-controller Transport
#
# default:
CONFIG_UART_HW_FLOWCTRL_DISABLE=y
# default:
# CONFIG_UART_HW_FLOWCTRL_CTS_RTS is not set
# default:
CONFIG_BT_NIMBLE_HCI_UART_FLOW_CTRL=0
# default:
CONFIG_BT_NIMBLE_HCI_UART_RTS_PIN=19
# default:
CONFIG_BT_NIMBLE_HCI_UART_CTS_PIN=23
# end of Host-controller Transport

#
# Debugging/Testing
#
# default:
# CONFIG_BT_NIMBLE_MEM_DEBUG is not set
# default:
# CONFIG_BT_NIMBLE_LOG_LEVEL_NONE is not set
# default:
# CONFIG_BT_NIMBLE_LOG_LEVEL_ERROR is not set
# default:
# CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING is not set
# default:
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y
# default:
# CONFIG_BT_NIMBLE_LOG_LEVEL_DEBUG is not set
# default:
CONFIG_BT_NIMBLE_LOG_LEVEL=1
# default:
CONFIG_BT_NIMBLE_PRINT_ERR_NAME=y
# default:
# CONFIG_BT_NIMBLE_DEBUG is not set
# default:
# CONFIG_BT_NIMBLE_TEST_THROUGHPUT_TEST is not set
# end of Debugging/Testing

#
# Vendor / Optimization
#
# default:
# CONFIG_BT_NIMBLE_VS_SUPPORT is not set
# default:
# CONFIG_BT_NIMBLE_HIGH_DUTY_ADV_ITVL is not set
# end of Vendor / Optimization

#
# Helper Utils
#
# default:
CONFIG_BT_NIMBLE_CHK_HOST_STATUS=y
# default:
CONFIG_BT_NIMBLE_UTIL_API=y
# default:
CONFIG_BT_NIMBLE_EXTRA_ADV_FIELDS=y
# end of Helper Utils
# end of NimBLE Options

